Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.ModId Property
 The time stamp of the result.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int ModId { get; }
Public ReadOnly Property ModId As Integer
	Get
Property Value
Type: Int32
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace